import Image from "next/image";
import SectionTitle from "../SectionTitle";
import { getTranslations } from "next-intl/server";
import FaqAccordion from "../Segments/FaqAccordion";
import { FaqAccordionItemType } from "@/app/_types/FaqAccordionItemType";

const faqData: Array<FaqAccordionItemType> = [
  {
    title: "ماهي معايير القبول في الجامعة الاسلامية ؟",
    body: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى.... هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى.... هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى.... هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى.... ",
  },
  {
    title: "ماهي معايير القبول في الجامعة الاسلامية ؟",
    body: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى.... هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى.... هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى.... هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى.... ",
  },
  {
    title: "ماهي معايير القبول في الجامعة الاسلامية ؟",
    body: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى.... هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى.... هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى.... هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى.... ",
  },
];

export default async function Faq() {
  const t = await getTranslations("sections.faq");
  return (
    <div className={`mt-6 bg-[#F5F5F5] px-5 py-7 md:px-12`}>
      {/* title  */}
      <SectionTitle text={t("section_title")} />

      <div className="py-1">
        {/* Faq Accordion component  */}
        <FaqAccordion data={faqData} />
        {/* End Faq Accordion component  */}
      </div>
    </div>
  );
}
